vagrant/meshiterro/app/controllers/favorites_controller.rb

SELECT  "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "post_image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["post_image_id", 1], ["created_at", "2020-01-13 01:36:59.504558"], ["updated_at", "2020-01-13 01:36:59.504558"]]
---
	def create
		post_image = PostImage.find(params[:post_image_id])
        favorite = current_user.favorites.new(post_image_id: post_image.id)
        favorite.save